woai66/stm32u5-rehab-band/upper-arm/upper arm.ioc
VP_STMicroelectronics.X-CUBE-FREERTOS_VS_CMSISJjRTOS2_11.2.0_1.5.0.Mode=CMSISJjRTOS2
VP_STMicroelectronics.X-CUBE-FREERTOS_VS_CMSISJjRTOS2_11.2.0_1.5.0.Signal=STMicroelectronics.X-CUBE-FREERTOS_VS_CMSISJjRTOS2_11.2.0_1.5.0
VP_SYS_VS_tim17.Mode=TIM17
VP_SYS_VS_tim17.Signal=SYS_VS_tim17
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
board=custom
rtos.0.binarySems.0=allocationType,Dynamic;controlBlockName,NULL;initialState,Depleted;name,imuDmaDoneSem
rtos.0.binarySems.1=allocationType,Dynamic;controlBlockName,NULL;initialState,Depleted;name,adcHalfCpltSem
rtos.0.binarySems.2=allocationType,Dynamic;controlBlockName,NULL;initialState,Depleted;name,adcCpltSem
rtos.0.ip=STMicroelectronics.X-CUBE-FREERTOS.1.5.0
rtos.0.mutexes.0=allocationType,Dynamic;controlBlockName,NULL;name,uart1Mutex
rtos.0.mutexes.1=allocationType,Dynamic;controlBlockName,NULL;name,uart2Mutex
rtos.0.mutexes.2=allocationType,Dynamic;controlBlockName,NULL;name,spi3LcdMutex
rtos.0.mutexes.3=allocationType,Dynamic;controlBlockName,NULL;name,rehabStateMutex
rtos.0.queues.0=allocationType,Dynamic;bufferName,NULL;controlBlockName,NULL;itemNumber,4;itemSize,48;name,imuFrameQueue
rtos.0.queues.1=allocationType,Dynamic;bufferName,NULL;controlBlockName,NULL;itemNumber,2;itemSize,32;name,rehabStateQueue
rtos.0.queues.2=allocationType,Dynamic;bufferName,NULL;controlBlockName,NULL;itemNumber,8;itemSize,64;name,debugLogQueue
rtos.0.tasks.0=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartDefaultTask;name,defaultTask;parameter,NULL;priority,osPriorityNormal;stackSize,128
rtos.0.tasks.1=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartSensorTask;name,SensorTask;parameter,NULL;priority,osPriorityHigh;stackSize,512
rtos.0.tasks.2=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartAlgoTask;name,AlgoTask;parameter,NULL;priority,osPriorityAboveNormal;stackSize,1024
rtos.0.tasks.3=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartEmgTask;name,EmgTask;parameter,NULL;priority,osPriorityAboveNormal;stackSize,512
rtos.0.tasks.4=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartWirelessTask;name,WirelessTask;parameter,NULL;priority,osPriorityNormal;stackSize,512
rtos.0.tasks.5=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartDataStreamTask;name,DataStreamTask;parameter,NULL;priority,osPriorityNormal;stackSize,512
rtos.0.tasks.6=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartUiTask;name,UiTask;parameter,NULL;priority,osPriorityNormal;stackSize,384
rtos.0.tasks.7=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartDisplayTask;name,DisplayTask;parameter,NULL;priority,osPriorityLow;stackSize,2048
rtos.0.tasks.8=allocationType,Dynamic;bufferName,NULL;codeGen,Default;controlBlockName,NULL;entry,StartDebugTask;name,DebugTask;parameter,NULL;priority,osPriorityLow;stackSize,512
